ankuns/nrfx/bsp/stable/mdk/nrf7140_global.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7140_GLOBAL_H
#define NRF7140_GLOBAL_H

#ifdef __cplusplus
    extern "C" {
#endif


/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_FICR_NS_BASE                  0x0FFFE000UL
#define NRF_USBHSCORE0_NS_BASE            0x2F700000UL
#define NRF_USBHSCORE0_S_BASE             0x2F700000UL
#define NRF_I3CCORE120_NS_BASE            0x2FBE0000UL
#define NRF_I3CCORE121_NS_BASE            0x2FBE1000UL
#define NRF_DMU120_NS_BASE                0x2FBEF800UL
#define NRF_MCAN120_NS_BASE               0x2FBEF800UL
#define NRF_DMU121_NS_BASE                0x2FBF7800UL
#define NRF_MCAN121_NS_BASE               0x2FBF7800UL
#define NRF_STMDATA_NS_BASE               0xA0000000UL
#define NRF_STMDATA_S_BASE                0xA0000000UL
#define NRF_TDDCONF_NS_BASE               0xBF001000UL
#define NRF_TDDCONF_S_BASE                0xBF001000UL
#define NRF_TSGEN_NS_BASE                 0xBF041000UL
#define NRF_STM_NS_BASE                   0xBF042000UL
#define NRF_TPIU_NS_BASE                  0xBF043000UL
#define NRF_ETB_NS_BASE                   0xBF044000UL
#define NRF_ETR_NS_BASE                   0xBF045000UL
#define NRF_CTI210_NS_BASE                0xBF046000UL
#define NRF_CTI211_NS_BASE                0xBF047000UL
#define NRF_ATBREPLICATOR210_NS_BASE      0xBF048000UL
#define NRF_ATBREPLICATOR211_NS_BASE      0xBF049000UL
#define NRF_ATBREPLICATOR212_NS_BASE      0xBF04A000UL
#define NRF_ATBREPLICATOR213_NS_BASE      0xBF04B000UL
#define NRF_ATBFUNNEL210_NS_BASE          0xBF04C000UL
#define NRF_ATBFUNNEL211_NS_BASE          0xBF04D000UL
#define NRF_ATBFUNNEL212_NS_BASE          0xBF04E000UL
#define NRF_ATBFUNNEL213_NS_BASE          0xBF04F000UL
#define NRF_GFXPLL_NS_BASE                0x4900B000UL
#define NRF_GFXPLLPM_NS_BASE              0x4900C000UL
#define NRF_PCGCSBUS_NS_BASE              0x4900CF00UL
#define NRF_HSFLL300_NS_BASE              0x4900D000UL
#define NRF_LRCCONF300_NS_BASE            0x4900E000UL
#define NRF_PCGCM300_NS_BASE              0x4900F000UL
#define NRF_MEMCONF310_NS_BASE            0x49011000UL
#define NRF_VREGGFX_NS_BASE               0x49012000UL
#define NRF_LRCCONF310_NS_BASE            0x4901E000UL
#define NRF_PCGCM310_NS_BASE              0x4901F000UL
#define NRF_GPIOTE130_NS_BASE             0x4F934000UL
#define NRF_GPIOTE130_S_BASE              0x5F934000UL
#define NRF_GRTC_NS_BASE                  0x4F99C000UL
#define NRF_GRTC_S_BASE                   0x5F99C000UL
#define NRF_GSI_NS_BASE                   0x49008000UL
#define NRF_DISPC_NS_BASE                 0x49004000UL
#define NRF_GPU_NS_BASE                   0x49000000UL
#define NRF_TBM_NS_BASE                   0xBF003000UL
#define NRF_TBM_S_BASE                    0xBF003000UL
#define NRF_USBHS_NS_BASE                 0x4F086000UL
#define NRF_USBHS_S_BASE                  0x5F086000UL
#define NRF_MRAMC110_NS_BASE              0x4F092000UL
#define NRF_MRAMC110_S_BASE               0x5F092000UL
#define NRF_MRAMC111_NS_BASE              0x4F093000UL
#define NRF_MRAMC111_S_BASE               0x5F093000UL
#define NRF_EXMIF_NS_BASE                 0x4F095000UL
#define NRF_EXMIF_S_BASE                  0x5F095000UL
#define NRF_CANPLL_NS_BASE                0x4F8C2000UL
#define NRF_CANPLLPM_S_BASE               0x5F8C2000UL
#define NRF_CANPLL_S_BASE                 0x5F8C2000UL
#define NRF_OTPC_S_BASE                   0x5F8C5000UL
#define NRF_VPR120_NS_BASE                0x4F8C8000UL
#define NRF_VPR120_S_BASE                 0x5F8C8000UL
#define NRF_SDCARD_NS_BASE                0x4F8C9000UL
#define NRF_SDCARD_S_BASE                 0x5F8C9000UL
#define NRF_LRCCONF_SDCARD_NS_BASE        0x4F8CA000UL
#define NRF_HSFLL122_NS_BASE              0x4F8CB000UL
#define NRF_HSFLL122_S_BASE               0x5F8CB000UL
#define NRF_HSFLL121_NS_BASE              0x4F8CC000UL
#define NRF_HSFLL121_S_BASE               0x5F8CC000UL
#define NRF_IPCT120_NS_BASE               0x4F8D1000UL
#define NRF_IPCT120_S_BASE                0x5F8D1000UL
#define NRF_MUTEX120_NS_BASE              0x4F8D2000UL
#define NRF_PROTOTYPE_NS_BASE             0x4F8D2000UL
#define NRF_I3C120_NS_BASE                0x4F8D3000UL
#define NRF_I3C120_S_BASE                 0x5F8D3000UL
#define NRF_VPR121_NS_BASE                0x4F8D4000UL
#define NRF_VPR121_S_BASE                 0x5F8D4000UL
#define NRF_QSPI120_NS_BASE               0x4F8D7000UL
#define NRF_QSPI120_S_BASE                0x5F8D7000UL
#define NRF_CAN120_NS_BASE                0x4F8D8000UL
#define NRF_CAN120_S_BASE                 0x5F8D8000UL
#define NRF_MVDMA120_NS_BASE              0x4F8D9000UL
#define NRF_MVDMA120_S_BASE               0x5F8D9000UL
#define NRF_RAMC122_NS_BASE               0x4F8DA000UL
#define NRF_RAMC122_S_BASE                0x5F8DA000UL
#define NRF_CAN121_NS_BASE                0x4F8DB000UL
#define NRF_CAN121_S_BASE                 0x5F8DB000UL
#define NRF_MVDMA121_NS_BASE              0x4F8DC000UL
#define NRF_MVDMA121_S_BASE               0x5F8DC000UL
#define NRF_RAMC123_NS_BASE               0x4F8DD000UL
#define NRF_RAMC123_S_BASE                0x5F8DD000UL
#define NRF_I3C121_NS_BASE                0x4F8DE000UL
#define NRF_I3C121_S_BASE                 0x5F8DE000UL
#define NRF_QSPI121_NS_BASE               0x4F8DF000UL
#define NRF_QSPI121_S_BASE                0x5F8DF000UL
#define NRF_DPPIC120_NS_BASE              0x4F8E1000UL
#define NRF_DPPIC120_S_BASE               0x5F8E1000UL
#define NRF_TIMER120_NS_BASE              0x4F8E2000UL
#define NRF_TIMER120_S_BASE               0x5F8E2000UL
#define NRF_TIMER121_NS_BASE              0x4F8E3000UL
#define NRF_TIMER121_S_BASE               0x5F8E3000UL
#define NRF_PWM120_NS_BASE                0x4F8E4000UL
#define NRF_PWM120_S_BASE                 0x5F8E4000UL
#define NRF_SPIS120_NS_BASE               0x4F8E5000UL
#define NRF_SPIS120_S_BASE                0x5F8E5000UL
#define NRF_SPIM120_NS_BASE               0x4F8E6000UL
#define NRF_UARTE120_NS_BASE              0x4F8E6000UL
#define NRF_SPIM120_S_BASE                0x5F8E6000UL
#define NRF_UARTE120_S_BASE               0x5F8E6000UL
#define NRF_SPIM121_NS_BASE               0x4F8E7000UL
#define NRF_SPIM121_S_BASE                0x5F8E7000UL
#define NRF_SPIM122_NS_BASE               0x4F8E8000UL
#define NRF_SPIM122_S_BASE                0x5F8E8000UL
#define NRF_SPIM123_NS_BASE               0x4F8E9000UL
#define NRF_SPIM123_S_BASE                0x5F8E9000UL
#define NRF_VPR130_NS_BASE                0x4F908000UL
#define NRF_VPR130_S_BASE                 0x5F908000UL
#define NRF_IPCT130_NS_BASE               0x4F921000UL
#define NRF_IPCT130_S_BASE                0x5F921000UL
#define NRF_DPPIC130_NS_BASE              0x4F922000UL
#define NRF_DPPIC130_S_BASE               0x5F922000UL
#define NRF_MUTEX130_NS_BASE              0x4F927000UL
#define NRF_RTC130_NS_BASE                0x4F928000UL
#define NRF_RTC130_S_BASE                 0x5F928000UL
#define NRF_RTC131_NS_BASE                0x4F929000UL
#define NRF_RTC131_S_BASE                 0x5F929000UL
#define NRF_WDT131_NS_BASE                0x4F92B000UL
#define NRF_WDT131_S_BASE                 0x5F92B000UL
#define NRF_WDT132_NS_BASE                0x4F92C000UL
#define NRF_WDT132_S_BASE                 0x5F92C000UL
#define NRF_EGU130_NS_BASE                0x4F92D000UL
#define NRF_EGU130_S_BASE                 0x5F92D000UL
#define NRF_COEXC_NS_BASE                 0x4F92E000UL
#define NRF_COEXC_S_BASE                  0x5F92E000UL
#define NRF_P0_NS_BASE                    0x4F938000UL
#define NRF_P1_NS_BASE                    0x4F938200UL
#define NRF_P2_NS_BASE                    0x4F938400UL
#define NRF_P3_NS_BASE                    0x4F938600UL
#define NRF_P5_NS_BASE                    0x4F938A00UL
#define NRF_P6_NS_BASE                    0x4F938C00UL
#define NRF_P0_S_BASE                     0x5F938000UL
#define NRF_P1_S_BASE                     0x5F938200UL
#define NRF_P2_S_BASE                     0x5F938400UL
#define NRF_P3_S_BASE                     0x5F938600UL
#define NRF_P5_S_BASE                     0x5F938A00UL
#define NRF_P6_S_BASE                     0x5F938C00UL
#define NRF_P8_NS_BASE                    0x4F939000UL
#define NRF_P9_NS_BASE                    0x4F939200UL
#define NRF_GPIOINTERNAL_NS_BASE          0x4F939E00UL
#define NRF_P8_S_BASE                     0x5F939000UL
#define NRF_P9_S_BASE                     0x5F939200UL
#define NRF_GPIOINTERNAL_S_BASE           0x5F939E00UL
#define NRF_RESETHUB_S_BASE               0x5F949000UL
#define NRF_AUDIOPLL_NS_BASE              0x4F957000UL
#define NRF_AUDIOPLL_S_BASE               0x5F957000UL
#define NRF_USBHSPLL_NS_BASE              0x4F958000UL
#define NRF_USBHSPLL_S_BASE               0x5F958000UL
#define NRF_VREGUSB_NS_BASE               0x4F967000UL
#define NRF_VREGUSB_S_BASE                0x5F967000UL
#define NRF_AUDIOPLLPM_NS_BASE            0x4F968000UL
#define NRF_AUDIOPLLPM_S_BASE             0x5F968000UL
#define NRF_DPPIC131_NS_BASE              0x4F981000UL
#define NRF_DPPIC131_S_BASE               0x5F981000UL
#define NRF_SAADC_NS_BASE                 0x4F982000UL
#define NRF_SAADC_S_BASE                  0x5F982000UL
#define NRF_COMP_NS_BASE                  0x4F983000UL
#define NRF_LPCOMP_NS_BASE                0x4F983000UL
#define NRF_COMP_S_BASE                   0x5F983000UL
#define NRF_LPCOMP_S_BASE                 0x5F983000UL
#define NRF_TEMP_NS_BASE                  0x4F984000UL
#define NRF_TEMP_S_BASE                   0x5F984000UL
#define NRF_NFCT_NS_BASE                  0x4F985000UL
#define NRF_NFCT_S_BASE                   0x5F985000UL
#define NRF_DPPIC132_NS_BASE              0x4F991000UL
#define NRF_DPPIC132_S_BASE               0x5F991000UL
#define NRF_TDM130_NS_BASE                0x4F992000UL
#define NRF_TDM130_S_BASE                 0x5F992000UL
#define NRF_QDEC130_NS_BASE               0x4F994000UL
#define NRF_QDEC130_S_BASE                0x5F994000UL
#define NRF_QDEC131_NS_BASE               0x4F995000UL
#define NRF_QDEC131_S_BASE                0x5F995000UL
#define NRF_SIMIF130_NS_BASE              0x4F996000UL
#define NRF_SIMIF130_S_BASE               0x5F996000UL
#define NRF_TDM131_NS_BASE                0x4F997000UL
#define NRF_TDM131_S_BASE                 0x5F997000UL
#define NRF_TDM132_NS_BASE                0x4F999000UL
#define NRF_TDM132_S_BASE                 0x5F999000UL
#define NRF_DPPIC133_NS_BASE              0x4F9A1000UL
#define NRF_DPPIC133_S_BASE               0x5F9A1000UL
#define NRF_TIMER130_NS_BASE              0x4F9A2000UL
#define NRF_TIMER130_S_BASE               0x5F9A2000UL
#define NRF_TIMER131_NS_BASE              0x4F9A3000UL
#define NRF_TIMER131_S_BASE               0x5F9A3000UL
#define NRF_PWM130_NS_BASE                0x4F9A4000UL
#define NRF_PWM130_S_BASE                 0x5F9A4000UL
#define NRF_SPIM130_NS_BASE               0x4F9A5000UL
#define NRF_SPIS130_NS_BASE               0x4F9A5000UL
#define NRF_TWIM130_NS_BASE               0x4F9A5000UL
#define NRF_TWIS130_NS_BASE               0x4F9A5000UL
#define NRF_UARTE130_NS_BASE              0x4F9A5000UL
#define NRF_SPIM130_S_BASE                0x5F9A5000UL
#define NRF_SPIS130_S_BASE                0x5F9A5000UL
#define NRF_TWIM130_S_BASE                0x5F9A5000UL
#define NRF_TWIS130_S_BASE                0x5F9A5000UL
#define NRF_UARTE130_S_BASE               0x5F9A5000UL
#define NRF_SPIM131_NS_BASE               0x4F9A6000UL
#define NRF_SPIS131_NS_BASE               0x4F9A6000UL
#define NRF_TWIM131_NS_BASE               0x4F9A6000UL
#define NRF_TWIS131_NS_BASE               0x4F9A6000UL
#define NRF_UARTE131_NS_BASE              0x4F9A6000UL
#define NRF_SPIM131_S_BASE                0x5F9A6000UL
#define NRF_SPIS131_S_BASE                0x5F9A6000UL
#define NRF_TWIM131_S_BASE                0x5F9A6000UL
#define NRF_TWIS131_S_BASE                0x5F9A6000UL
#define NRF_UARTE131_S_BASE               0x5F9A6000UL
#define NRF_PDM130_NS_BASE                0x4F9A7000UL
#define NRF_PDM130_S_BASE                 0x5F9A7000UL
#define NRF_DPPIC134_NS_BASE              0x4F9B1000UL
#define NRF_DPPIC134_S_BASE               0x5F9B1000UL
#define NRF_TIMER132_NS_BASE              0x4F9B2000UL
#define NRF_TIMER132_S_BASE               0x5F9B2000UL
#define NRF_TIMER133_NS_BASE              0x4F9B3000UL
#define NRF_TIMER133_S_BASE               0x5F9B3000UL
#define NRF_PWM131_NS_BASE                0x4F9B4000UL
#define NRF_PWM131_S_BASE                 0x5F9B4000UL
#define NRF_SPIM132_NS_BASE               0x4F9B5000UL
#define NRF_SPIS132_NS_BASE               0x4F9B5000UL
#define NRF_TWIM132_NS_BASE               0x4F9B5000UL
#define NRF_TWIS132_NS_BASE               0x4F9B5000UL
#define NRF_UARTE132_NS_BASE              0x4F9B5000UL
#define NRF_SPIM132_S_BASE                0x5F9B5000UL
#define NRF_SPIS132_S_BASE                0x5F9B5000UL
#define NRF_TWIM132_S_BASE                0x5F9B5000UL
#define NRF_TWIS132_S_BASE                0x5F9B5000UL
#define NRF_UARTE132_S_BASE               0x5F9B5000UL
#define NRF_SPIM133_NS_BASE               0x4F9B6000UL
#define NRF_SPIS133_NS_BASE               0x4F9B6000UL
#define NRF_TWIM133_NS_BASE               0x4F9B6000UL
#define NRF_TWIS133_NS_BASE               0x4F9B6000UL
#define NRF_UARTE133_NS_BASE              0x4F9B6000UL
#define NRF_SPIM133_S_BASE                0x5F9B6000UL
#define NRF_SPIS133_S_BASE                0x5F9B6000UL
#define NRF_TWIM133_S_BASE                0x5F9B6000UL
#define NRF_TWIS133_S_BASE                0x5F9B6000UL
#define NRF_UARTE133_S_BASE               0x5F9B6000UL
#define NRF_PDM131_NS_BASE                0x4F9B7000UL
#define NRF_PDM131_S_BASE                 0x5F9B7000UL
#define NRF_DPPIC135_NS_BASE              0x4F9C1000UL
#define NRF_DPPIC135_S_BASE               0x5F9C1000UL
#define NRF_TIMER134_NS_BASE              0x4F9C2000UL
#define NRF_TIMER134_S_BASE               0x5F9C2000UL
#define NRF_TIMER135_NS_BASE              0x4F9C3000UL
#define NRF_TIMER135_S_BASE               0x5F9C3000UL
#define NRF_PWM132_NS_BASE                0x4F9C4000UL
#define NRF_PWM132_S_BASE                 0x5F9C4000UL
#define NRF_SPIM134_NS_BASE               0x4F9C5000UL
#define NRF_SPIS134_NS_BASE               0x4F9C5000UL
#define NRF_TWIM134_NS_BASE               0x4F9C5000UL
#define NRF_TWIS134_NS_BASE               0x4F9C5000UL
#define NRF_UARTE134_NS_BASE              0x4F9C5000UL
#define NRF_SPIM134_S_BASE                0x5F9C5000UL
#define NRF_SPIS134_S_BASE                0x5F9C5000UL
#define NRF_TWIM134_S_BASE                0x5F9C5000UL
#define NRF_TWIS134_S_BASE                0x5F9C5000UL
#define NRF_UARTE134_S_BASE               0x5F9C5000UL
#define NRF_SPIM135_NS_BASE               0x4F9C6000UL
#define NRF_SPIS135_NS_BASE               0x4F9C6000UL
#define NRF_TWIM135_NS_BASE               0x4F9C6000UL
#define NRF_TWIS135_NS_BASE               0x4F9C6000UL
#define NRF_UARTE135_NS_BASE              0x4F9C6000UL
#define NRF_SPIM135_S_BASE                0x5F9C6000UL
#define NRF_SPIS135_S_BASE                0x5F9C6000UL
#define NRF_TWIM135_S_BASE                0x5F9C6000UL
#define NRF_TWIS135_S_BASE                0x5F9C6000UL
#define NRF_UARTE135_S_BASE               0x5F9C6000UL
#define NRF_PDM132_NS_BASE                0x4F9C7000UL
#define NRF_PDM132_S_BASE                 0x5F9C7000UL
#define NRF_DPPIC136_NS_BASE              0x4F9D1000UL
#define NRF_DPPIC136_S_BASE               0x5F9D1000UL
#define NRF_TIMER136_NS_BASE              0x4F9D2000UL
#define NRF_TIMER136_S_BASE               0x5F9D2000UL
#define NRF_TIMER137_NS_BASE              0x4F9D3000UL
#define NRF_TIMER137_S_BASE               0x5F9D3000UL
#define NRF_PWM133_NS_BASE                0x4F9D4000UL
#define NRF_PWM133_S_BASE                 0x5F9D4000UL
#define NRF_SPIM136_NS_BASE               0x4F9D5000UL
#define NRF_SPIS136_NS_BASE               0x4F9D5000UL
#define NRF_TWIM136_NS_BASE               0x4F9D5000UL
#define NRF_TWIS136_NS_BASE               0x4F9D5000UL
#define NRF_UARTE136_NS_BASE              0x4F9D5000UL
#define NRF_SPIM136_S_BASE                0x5F9D5000UL
#define NRF_SPIS136_S_BASE                0x5F9D5000UL
#define NRF_TWIM136_S_BASE                0x5F9D5000UL
#define NRF_TWIS136_S_BASE                0x5F9D5000UL
#define NRF_UARTE136_S_BASE               0x5F9D5000UL
#define NRF_SPIM137_NS_BASE               0x4F9D6000UL
#define NRF_SPIS137_NS_BASE               0x4F9D6000UL
#define NRF_TWIM137_NS_BASE               0x4F9D6000UL
#define NRF_TWIS137_NS_BASE               0x4F9D6000UL
#define NRF_UARTE137_NS_BASE              0x4F9D6000UL
#define NRF_SPIM137_S_BASE                0x5F9D6000UL
#define NRF_SPIS137_S_BASE                0x5F9D6000UL
#define NRF_TWIM137_S_BASE                0x5F9D6000UL
#define NRF_TWIS137_S_BASE                0x5F9D6000UL
#define NRF_UARTE137_S_BASE               0x5F9D6000UL
#define NRF_PDM133_NS_BASE                0x4F9D7000UL
#define NRF_PDM133_S_BASE                 0x5F9D7000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

