ankuns/nrfx/bsp/stable/mdk/nrf7140_global.h
#define NRF_FICR_NS                       ((NRF_FICR_Type*)                     NRF_FICR_NS_BASE)
#define NRF_USBHSCORE0_NS                 ((NRF_USBHSCORE_Type*)                NRF_USBHSCORE0_NS_BASE)
#define NRF_USBHSCORE0_S                  ((NRF_USBHSCORE_Type*)                NRF_USBHSCORE0_S_BASE)
#define NRF_I3CCORE120_NS                 ((NRF_I3CCORE_Type*)                  NRF_I3CCORE120_NS_BASE)
#define NRF_I3CCORE121_NS                 ((NRF_I3CCORE_Type*)                  NRF_I3CCORE121_NS_BASE)
#define NRF_DMU120_NS                     ((NRF_DMU_Type*)                      NRF_DMU120_NS_BASE)
#define NRF_MCAN120_NS                    ((NRF_MCAN_Type*)                     NRF_MCAN120_NS_BASE)
#define NRF_DMU121_NS                     ((NRF_DMU_Type*)                      NRF_DMU121_NS_BASE)
#define NRF_MCAN121_NS                    ((NRF_MCAN_Type*)                     NRF_MCAN121_NS_BASE)
#define NRF_STMDATA_NS                    ((NRF_STMDATA_Type*)                  NRF_STMDATA_NS_BASE)
#define NRF_STMDATA_S                     ((NRF_STMDATA_Type*)                  NRF_STMDATA_S_BASE)
#define NRF_TDDCONF_NS                    ((NRF_TDDCONF_Type*)                  NRF_TDDCONF_NS_BASE)
#define NRF_TDDCONF_S                     ((NRF_TDDCONF_Type*)                  NRF_TDDCONF_S_BASE)
#define NRF_TSGEN_NS                      ((NRF_TSGEN_Type*)                    NRF_TSGEN_NS_BASE)
#define NRF_STM_NS                        ((NRF_STM_Type*)                      NRF_STM_NS_BASE)
#define NRF_TPIU_NS                       ((NRF_TPIU_Type*)                     NRF_TPIU_NS_BASE)
#define NRF_ETB_NS                        ((NRF_ETB_Type*)                      NRF_ETB_NS_BASE)
#define NRF_ETR_NS                        ((NRF_ETR_Type*)                      NRF_ETR_NS_BASE)
#define NRF_CTI210_NS                     ((NRF_CTI_Type*)                      NRF_CTI210_NS_BASE)
#define NRF_CTI211_NS                     ((NRF_CTI_Type*)                      NRF_CTI211_NS_BASE)
#define NRF_ATBREPLICATOR210_NS           ((NRF_ATBREPLICATOR_Type*)            NRF_ATBREPLICATOR210_NS_BASE)
#define NRF_ATBREPLICATOR211_NS           ((NRF_ATBREPLICATOR_Type*)            NRF_ATBREPLICATOR211_NS_BASE)
#define NRF_ATBREPLICATOR212_NS           ((NRF_ATBREPLICATOR_Type*)            NRF_ATBREPLICATOR212_NS_BASE)
#define NRF_ATBREPLICATOR213_NS           ((NRF_ATBREPLICATOR_Type*)            NRF_ATBREPLICATOR213_NS_BASE)
#define NRF_ATBFUNNEL210_NS               ((NRF_ATBFUNNEL_Type*)                NRF_ATBFUNNEL210_NS_BASE)
#define NRF_ATBFUNNEL211_NS               ((NRF_ATBFUNNEL_Type*)                NRF_ATBFUNNEL211_NS_BASE)
#define NRF_ATBFUNNEL212_NS               ((NRF_ATBFUNNEL_Type*)                NRF_ATBFUNNEL212_NS_BASE)
#define NRF_ATBFUNNEL213_NS               ((NRF_ATBFUNNEL_Type*)                NRF_ATBFUNNEL213_NS_BASE)
#define NRF_GFXPLL_NS                     ((NRF_AUXPLL_Type*)                   NRF_GFXPLL_NS_BASE)
#define NRF_GFXPLLPM_NS                   ((NRF_AUXPM_Type*)                    NRF_GFXPLLPM_NS_BASE)
#define NRF_PCGCSBUS_NS                   ((NRF_PCGCSLAVE_Type*)                NRF_PCGCSBUS_NS_BASE)
#define NRF_HSFLL300_NS                   ((NRF_HSFLL_Type*)                    NRF_HSFLL300_NS_BASE)
#define NRF_LRCCONF300_NS                 ((NRF_LRCCONF_Type*)                  NRF_LRCCONF300_NS_BASE)
#define NRF_PCGCM300_NS                   ((NRF_PCGCMASTER_Type*)               NRF_PCGCM300_NS_BASE)
#define NRF_MEMCONF310_NS                 ((NRF_MEMCONF_Type*)                  NRF_MEMCONF310_NS_BASE)
#define NRF_VREGGFX_NS                    ((NRF_VREGVS0V8_Type*)                NRF_VREGGFX_NS_BASE)
#define NRF_LRCCONF310_NS                 ((NRF_LRCCONF_Type*)                  NRF_LRCCONF310_NS_BASE)
#define NRF_PCGCM310_NS                   ((NRF_PCGCMASTER_Type*)               NRF_PCGCM310_NS_BASE)
#define NRF_GPIOTE130_NS                  ((NRF_GPIOTE_Type*)                   NRF_GPIOTE130_NS_BASE)
#define NRF_GPIOTE130_S                   ((NRF_GPIOTE_Type*)                   NRF_GPIOTE130_S_BASE)
#define NRF_GRTC_NS                       ((NRF_GRTC_Type*)                     NRF_GRTC_NS_BASE)
#define NRF_GRTC_S                        ((NRF_GRTC_Type*)                     NRF_GRTC_S_BASE)
#define NRF_GSI_NS                        ((NRF_GSI_Type*)                      NRF_GSI_NS_BASE)
#define NRF_DISPC_NS                      ((NRF_DISPC_Type*)                    NRF_DISPC_NS_BASE)
#define NRF_GPU_NS                        ((NRF_GPU_Type*)                      NRF_GPU_NS_BASE)
#define NRF_TBM_NS                        ((NRF_TBM_Type*)                      NRF_TBM_NS_BASE)
#define NRF_TBM_S                         ((NRF_TBM_Type*)                      NRF_TBM_S_BASE)
#define NRF_USBHS_NS                      ((NRF_USBHS_Type*)                    NRF_USBHS_NS_BASE)
#define NRF_USBHS_S                       ((NRF_USBHS_Type*)                    NRF_USBHS_S_BASE)
#define NRF_MRAMC110_NS                   ((NRF_MRAMC_Type*)                    NRF_MRAMC110_NS_BASE)
#define NRF_MRAMC110_S                    ((NRF_MRAMC_Type*)                    NRF_MRAMC110_S_BASE)
#define NRF_MRAMC111_NS                   ((NRF_MRAMC_Type*)                    NRF_MRAMC111_NS_BASE)
#define NRF_MRAMC111_S                    ((NRF_MRAMC_Type*)                    NRF_MRAMC111_S_BASE)
#define NRF_EXMIF_NS                      ((NRF_EXMIF_Type*)                    NRF_EXMIF_NS_BASE)
#define NRF_EXMIF_S                       ((NRF_EXMIF_Type*)                    NRF_EXMIF_S_BASE)
#define NRF_CANPLL_NS                     ((NRF_AUXPLL_Type*)                   NRF_CANPLL_NS_BASE)
#define NRF_CANPLLPM_S                    ((NRF_AUXPM_Type*)                    NRF_CANPLLPM_S_BASE)
#define NRF_CANPLL_S                      ((NRF_AUXPLL_Type*)                   NRF_CANPLL_S_BASE)
#define NRF_OTPC_S                        ((NRF_OTPC_Type*)                     NRF_OTPC_S_BASE)
#define NRF_VPR120_NS                     ((NRF_VPR_Type*)                      NRF_VPR120_NS_BASE)
#define NRF_VPR120_S                      ((NRF_VPR_Type*)                      NRF_VPR120_S_BASE)
#define NRF_SDCARD_NS                     ((NRF_SDCARD_Type*)                   NRF_SDCARD_NS_BASE)
#define NRF_SDCARD_S                      ((NRF_SDCARD_Type*)                   NRF_SDCARD_S_BASE)
#define NRF_LRCCONF_SDCARD_NS             ((NRF_LRCCONF_Type*)                  NRF_LRCCONF_SDCARD_NS_BASE)
#define NRF_HSFLL122_NS                   ((NRF_HSFLL_Type*)                    NRF_HSFLL122_NS_BASE)
#define NRF_HSFLL122_S                    ((NRF_HSFLL_Type*)                    NRF_HSFLL122_S_BASE)
#define NRF_HSFLL121_NS                   ((NRF_HSFLL_Type*)                    NRF_HSFLL121_NS_BASE)
#define NRF_HSFLL121_S                    ((NRF_HSFLL_Type*)                    NRF_HSFLL121_S_BASE)
#define NRF_IPCT120_NS                    ((NRF_IPCT_Type*)                     NRF_IPCT120_NS_BASE)
#define NRF_IPCT120_S                     ((NRF_IPCT_Type*)                     NRF_IPCT120_S_BASE)
#define NRF_MUTEX120_NS                   ((NRF_MUTEX_Type*)                    NRF_MUTEX120_NS_BASE)
#define NRF_PROTOTYPE_NS                  ((NRF_PROTOTYPEINFO_Type*)            NRF_PROTOTYPE_NS_BASE)
#define NRF_I3C120_NS                     ((NRF_I3C_Type*)                      NRF_I3C120_NS_BASE)
#define NRF_I3C120_S                      ((NRF_I3C_Type*)                      NRF_I3C120_S_BASE)
#define NRF_VPR121_NS                     ((NRF_VPR_Type*)                      NRF_VPR121_NS_BASE)
#define NRF_VPR121_S                      ((NRF_VPR_Type*)                      NRF_VPR121_S_BASE)
#define NRF_QSPI120_NS                    ((NRF_QSPI_Type*)                     NRF_QSPI120_NS_BASE)
#define NRF_QSPI120_S                     ((NRF_QSPI_Type*)                     NRF_QSPI120_S_BASE)
#define NRF_CAN120_NS                     ((NRF_CAN_Type*)                      NRF_CAN120_NS_BASE)
#define NRF_CAN120_S                      ((NRF_CAN_Type*)                      NRF_CAN120_S_BASE)
#define NRF_MVDMA120_NS                   ((NRF_MVDMA_Type*)                    NRF_MVDMA120_NS_BASE)
#define NRF_MVDMA120_S                    ((NRF_MVDMA_Type*)                    NRF_MVDMA120_S_BASE)
#define NRF_RAMC122_NS                    ((NRF_RAMC_Type*)                     NRF_RAMC122_NS_BASE)
#define NRF_RAMC122_S                     ((NRF_RAMC_Type*)                     NRF_RAMC122_S_BASE)
#define NRF_CAN121_NS                     ((NRF_CAN_Type*)                      NRF_CAN121_NS_BASE)
#define NRF_CAN121_S                      ((NRF_CAN_Type*)                      NRF_CAN121_S_BASE)
#define NRF_MVDMA121_NS                   ((NRF_MVDMA_Type*)                    NRF_MVDMA121_NS_BASE)
#define NRF_MVDMA121_S                    ((NRF_MVDMA_Type*)                    NRF_MVDMA121_S_BASE)
#define NRF_RAMC123_NS                    ((NRF_RAMC_Type*)                     NRF_RAMC123_NS_BASE)
#define NRF_RAMC123_S                     ((NRF_RAMC_Type*)                     NRF_RAMC123_S_BASE)
#define NRF_I3C121_NS                     ((NRF_I3C_Type*)                      NRF_I3C121_NS_BASE)
#define NRF_I3C121_S                      ((NRF_I3C_Type*)                      NRF_I3C121_S_BASE)
#define NRF_QSPI121_NS                    ((NRF_QSPI_Type*)                     NRF_QSPI121_NS_BASE)
#define NRF_QSPI121_S                     ((NRF_QSPI_Type*)                     NRF_QSPI121_S_BASE)
#define NRF_DPPIC120_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC120_NS_BASE)
#define NRF_DPPIC120_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC120_S_BASE)
#define NRF_TIMER120_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER120_NS_BASE)
#define NRF_TIMER120_S                    ((NRF_TIMER_Type*)                    NRF_TIMER120_S_BASE)
#define NRF_TIMER121_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER121_NS_BASE)
#define NRF_TIMER121_S                    ((NRF_TIMER_Type*)                    NRF_TIMER121_S_BASE)
#define NRF_PWM120_NS                     ((NRF_PWM_Type*)                      NRF_PWM120_NS_BASE)
#define NRF_PWM120_S                      ((NRF_PWM_Type*)                      NRF_PWM120_S_BASE)
#define NRF_SPIS120_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS120_NS_BASE)
#define NRF_SPIS120_S                     ((NRF_SPIS_Type*)                     NRF_SPIS120_S_BASE)
#define NRF_SPIM120_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM120_NS_BASE)
#define NRF_UARTE120_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE120_NS_BASE)
#define NRF_SPIM120_S                     ((NRF_SPIM_Type*)                     NRF_SPIM120_S_BASE)
#define NRF_UARTE120_S                    ((NRF_UARTE_Type*)                    NRF_UARTE120_S_BASE)
#define NRF_SPIM121_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM121_NS_BASE)
#define NRF_SPIM121_S                     ((NRF_SPIM_Type*)                     NRF_SPIM121_S_BASE)
#define NRF_SPIM122_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM122_NS_BASE)
#define NRF_SPIM122_S                     ((NRF_SPIM_Type*)                     NRF_SPIM122_S_BASE)
#define NRF_SPIM123_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM123_NS_BASE)
#define NRF_SPIM123_S                     ((NRF_SPIM_Type*)                     NRF_SPIM123_S_BASE)
#define NRF_VPR130_NS                     ((NRF_VPR_Type*)                      NRF_VPR130_NS_BASE)
#define NRF_VPR130_S                      ((NRF_VPR_Type*)                      NRF_VPR130_S_BASE)
#define NRF_IPCT130_NS                    ((NRF_IPCT_Type*)                     NRF_IPCT130_NS_BASE)
#define NRF_IPCT130_S                     ((NRF_IPCT_Type*)                     NRF_IPCT130_S_BASE)
#define NRF_DPPIC130_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC130_NS_BASE)
#define NRF_DPPIC130_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC130_S_BASE)
#define NRF_MUTEX130_NS                   ((NRF_MUTEX_Type*)                    NRF_MUTEX130_NS_BASE)
#define NRF_RTC130_NS                     ((NRF_RTC_Type*)                      NRF_RTC130_NS_BASE)
#define NRF_RTC130_S                      ((NRF_RTC_Type*)                      NRF_RTC130_S_BASE)
#define NRF_RTC131_NS                     ((NRF_RTC_Type*)                      NRF_RTC131_NS_BASE)
#define NRF_RTC131_S                      ((NRF_RTC_Type*)                      NRF_RTC131_S_BASE)
#define NRF_WDT131_NS                     ((NRF_WDT_Type*)                      NRF_WDT131_NS_BASE)
#define NRF_WDT131_S                      ((NRF_WDT_Type*)                      NRF_WDT131_S_BASE)
#define NRF_WDT132_NS                     ((NRF_WDT_Type*)                      NRF_WDT132_NS_BASE)
#define NRF_WDT132_S                      ((NRF_WDT_Type*)                      NRF_WDT132_S_BASE)
#define NRF_EGU130_NS                     ((NRF_EGU_Type*)                      NRF_EGU130_NS_BASE)
#define NRF_EGU130_S                      ((NRF_EGU_Type*)                      NRF_EGU130_S_BASE)
#define NRF_COEXC_NS                      ((NRF_COEXC_Type*)                    NRF_COEXC_NS_BASE)
#define NRF_COEXC_S                       ((NRF_COEXC_Type*)                    NRF_COEXC_S_BASE)
#define NRF_P0_NS                         ((NRF_GPIO_Type*)                     NRF_P0_NS_BASE)
#define NRF_P1_NS                         ((NRF_GPIO_Type*)                     NRF_P1_NS_BASE)
#define NRF_P2_NS                         ((NRF_GPIO_Type*)                     NRF_P2_NS_BASE)
#define NRF_P3_NS                         ((NRF_GPIO_Type*)                     NRF_P3_NS_BASE)
#define NRF_P5_NS                         ((NRF_GPIO_Type*)                     NRF_P5_NS_BASE)
#define NRF_P6_NS                         ((NRF_GPIO_Type*)                     NRF_P6_NS_BASE)
#define NRF_P0_S                          ((NRF_GPIO_Type*)                     NRF_P0_S_BASE)
#define NRF_P1_S                          ((NRF_GPIO_Type*)                     NRF_P1_S_BASE)
#define NRF_P2_S                          ((NRF_GPIO_Type*)                     NRF_P2_S_BASE)
#define NRF_P3_S                          ((NRF_GPIO_Type*)                     NRF_P3_S_BASE)
#define NRF_P5_S                          ((NRF_GPIO_Type*)                     NRF_P5_S_BASE)
#define NRF_P6_S                          ((NRF_GPIO_Type*)                     NRF_P6_S_BASE)
#define NRF_P8_NS                         ((NRF_GPIO_Type*)                     NRF_P8_NS_BASE)
#define NRF_P9_NS                         ((NRF_GPIO_Type*)                     NRF_P9_NS_BASE)
#define NRF_GPIOINTERNAL_NS               ((NRF_GPIOINTERNAL_Type*)             NRF_GPIOINTERNAL_NS_BASE)
#define NRF_P8_S                          ((NRF_GPIO_Type*)                     NRF_P8_S_BASE)
#define NRF_P9_S                          ((NRF_GPIO_Type*)                     NRF_P9_S_BASE)
#define NRF_GPIOINTERNAL_S                ((NRF_GPIOINTERNAL_Type*)             NRF_GPIOINTERNAL_S_BASE)
#define NRF_RESETHUB_S                    ((NRF_RESETHUB_Type*)                 NRF_RESETHUB_S_BASE)
#define NRF_AUDIOPLL_NS                   ((NRF_AUXPLL_Type*)                   NRF_AUDIOPLL_NS_BASE)
#define NRF_AUDIOPLL_S                    ((NRF_AUXPLL_Type*)                   NRF_AUDIOPLL_S_BASE)
#define NRF_USBHSPLL_NS                   ((NRF_AUXPLL_Type*)                   NRF_USBHSPLL_NS_BASE)
#define NRF_USBHSPLL_S                    ((NRF_AUXPLL_Type*)                   NRF_USBHSPLL_S_BASE)
#define NRF_VREGUSB_NS                    ((NRF_VREGUSB_Type*)                  NRF_VREGUSB_NS_BASE)
#define NRF_VREGUSB_S                     ((NRF_VREGUSB_Type*)                  NRF_VREGUSB_S_BASE)
#define NRF_AUDIOPLLPM_NS                 ((NRF_AUXPM_Type*)                    NRF_AUDIOPLLPM_NS_BASE)
#define NRF_AUDIOPLLPM_S                  ((NRF_AUXPM_Type*)                    NRF_AUDIOPLLPM_S_BASE)
#define NRF_DPPIC131_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC131_NS_BASE)
#define NRF_DPPIC131_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC131_S_BASE)
#define NRF_SAADC_NS                      ((NRF_SAADC_Type*)                    NRF_SAADC_NS_BASE)
#define NRF_SAADC_S                       ((NRF_SAADC_Type*)                    NRF_SAADC_S_BASE)
#define NRF_COMP_NS                       ((NRF_COMP_Type*)                     NRF_COMP_NS_BASE)
#define NRF_LPCOMP_NS                     ((NRF_LPCOMP_Type*)                   NRF_LPCOMP_NS_BASE)
#define NRF_COMP_S                        ((NRF_COMP_Type*)                     NRF_COMP_S_BASE)
#define NRF_LPCOMP_S                      ((NRF_LPCOMP_Type*)                   NRF_LPCOMP_S_BASE)
#define NRF_TEMP_NS                       ((NRF_TEMP_Type*)                     NRF_TEMP_NS_BASE)
#define NRF_TEMP_S                        ((NRF_TEMP_Type*)                     NRF_TEMP_S_BASE)
#define NRF_NFCT_NS                       ((NRF_NFCT_Type*)                     NRF_NFCT_NS_BASE)
#define NRF_NFCT_S                        ((NRF_NFCT_Type*)                     NRF_NFCT_S_BASE)
#define NRF_DPPIC132_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC132_NS_BASE)
#define NRF_DPPIC132_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC132_S_BASE)
#define NRF_TDM130_NS                     ((NRF_TDM_Type*)                      NRF_TDM130_NS_BASE)
#define NRF_TDM130_S                      ((NRF_TDM_Type*)                      NRF_TDM130_S_BASE)
#define NRF_QDEC130_NS                    ((NRF_QDEC_Type*)                     NRF_QDEC130_NS_BASE)
#define NRF_QDEC130_S                     ((NRF_QDEC_Type*)                     NRF_QDEC130_S_BASE)
#define NRF_QDEC131_NS                    ((NRF_QDEC_Type*)                     NRF_QDEC131_NS_BASE)
#define NRF_QDEC131_S                     ((NRF_QDEC_Type*)                     NRF_QDEC131_S_BASE)
#define NRF_SIMIF130_NS                   ((NRF_SIMIF_Type*)                    NRF_SIMIF130_NS_BASE)
#define NRF_SIMIF130_S                    ((NRF_SIMIF_Type*)                    NRF_SIMIF130_S_BASE)
#define NRF_TDM131_NS                     ((NRF_TDM_Type*)                      NRF_TDM131_NS_BASE)
#define NRF_TDM131_S                      ((NRF_TDM_Type*)                      NRF_TDM131_S_BASE)
#define NRF_TDM132_NS                     ((NRF_TDM_Type*)                      NRF_TDM132_NS_BASE)
#define NRF_TDM132_S                      ((NRF_TDM_Type*)                      NRF_TDM132_S_BASE)
#define NRF_DPPIC133_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC133_NS_BASE)
#define NRF_DPPIC133_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC133_S_BASE)
#define NRF_TIMER130_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER130_NS_BASE)
#define NRF_TIMER130_S                    ((NRF_TIMER_Type*)                    NRF_TIMER130_S_BASE)
#define NRF_TIMER131_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER131_NS_BASE)
#define NRF_TIMER131_S                    ((NRF_TIMER_Type*)                    NRF_TIMER131_S_BASE)
#define NRF_PWM130_NS                     ((NRF_PWM_Type*)                      NRF_PWM130_NS_BASE)
#define NRF_PWM130_S                      ((NRF_PWM_Type*)                      NRF_PWM130_S_BASE)
#define NRF_SPIM130_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM130_NS_BASE)
#define NRF_SPIS130_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS130_NS_BASE)
#define NRF_TWIM130_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM130_NS_BASE)
#define NRF_TWIS130_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS130_NS_BASE)
#define NRF_UARTE130_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE130_NS_BASE)
#define NRF_SPIM130_S                     ((NRF_SPIM_Type*)                     NRF_SPIM130_S_BASE)
#define NRF_SPIS130_S                     ((NRF_SPIS_Type*)                     NRF_SPIS130_S_BASE)
#define NRF_TWIM130_S                     ((NRF_TWIM_Type*)                     NRF_TWIM130_S_BASE)
#define NRF_TWIS130_S                     ((NRF_TWIS_Type*)                     NRF_TWIS130_S_BASE)
#define NRF_UARTE130_S                    ((NRF_UARTE_Type*)                    NRF_UARTE130_S_BASE)
#define NRF_SPIM131_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM131_NS_BASE)
#define NRF_SPIS131_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS131_NS_BASE)
#define NRF_TWIM131_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM131_NS_BASE)
#define NRF_TWIS131_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS131_NS_BASE)
#define NRF_UARTE131_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE131_NS_BASE)
#define NRF_SPIM131_S                     ((NRF_SPIM_Type*)                     NRF_SPIM131_S_BASE)
#define NRF_SPIS131_S                     ((NRF_SPIS_Type*)                     NRF_SPIS131_S_BASE)
#define NRF_TWIM131_S                     ((NRF_TWIM_Type*)                     NRF_TWIM131_S_BASE)
#define NRF_TWIS131_S                     ((NRF_TWIS_Type*)                     NRF_TWIS131_S_BASE)
#define NRF_UARTE131_S                    ((NRF_UARTE_Type*)                    NRF_UARTE131_S_BASE)
#define NRF_PDM130_NS                     ((NRF_PDM_Type*)                      NRF_PDM130_NS_BASE)
#define NRF_PDM130_S                      ((NRF_PDM_Type*)                      NRF_PDM130_S_BASE)
#define NRF_DPPIC134_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC134_NS_BASE)
#define NRF_DPPIC134_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC134_S_BASE)
#define NRF_TIMER132_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER132_NS_BASE)
#define NRF_TIMER132_S                    ((NRF_TIMER_Type*)                    NRF_TIMER132_S_BASE)
#define NRF_TIMER133_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER133_NS_BASE)
#define NRF_TIMER133_S                    ((NRF_TIMER_Type*)                    NRF_TIMER133_S_BASE)
#define NRF_PWM131_NS                     ((NRF_PWM_Type*)                      NRF_PWM131_NS_BASE)
#define NRF_PWM131_S                      ((NRF_PWM_Type*)                      NRF_PWM131_S_BASE)
#define NRF_SPIM132_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM132_NS_BASE)
#define NRF_SPIS132_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS132_NS_BASE)
#define NRF_TWIM132_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM132_NS_BASE)
#define NRF_TWIS132_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS132_NS_BASE)
#define NRF_UARTE132_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE132_NS_BASE)
#define NRF_SPIM132_S                     ((NRF_SPIM_Type*)                     NRF_SPIM132_S_BASE)
#define NRF_SPIS132_S                     ((NRF_SPIS_Type*)                     NRF_SPIS132_S_BASE)
#define NRF_TWIM132_S                     ((NRF_TWIM_Type*)                     NRF_TWIM132_S_BASE)
#define NRF_TWIS132_S                     ((NRF_TWIS_Type*)                     NRF_TWIS132_S_BASE)
#define NRF_UARTE132_S                    ((NRF_UARTE_Type*)                    NRF_UARTE132_S_BASE)
#define NRF_SPIM133_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM133_NS_BASE)
#define NRF_SPIS133_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS133_NS_BASE)
#define NRF_TWIM133_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM133_NS_BASE)
#define NRF_TWIS133_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS133_NS_BASE)
#define NRF_UARTE133_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE133_NS_BASE)
