ankuns/nrfx/bsp/stable/mdk/nrf7140_global.h
#define NRF_SPIM133_S                     ((NRF_SPIM_Type*)                     NRF_SPIM133_S_BASE)
#define NRF_SPIS133_S                     ((NRF_SPIS_Type*)                     NRF_SPIS133_S_BASE)
#define NRF_TWIM133_S                     ((NRF_TWIM_Type*)                     NRF_TWIM133_S_BASE)
#define NRF_TWIS133_S                     ((NRF_TWIS_Type*)                     NRF_TWIS133_S_BASE)
#define NRF_UARTE133_S                    ((NRF_UARTE_Type*)                    NRF_UARTE133_S_BASE)
#define NRF_PDM131_NS                     ((NRF_PDM_Type*)                      NRF_PDM131_NS_BASE)
#define NRF_PDM131_S                      ((NRF_PDM_Type*)                      NRF_PDM131_S_BASE)
#define NRF_DPPIC135_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC135_NS_BASE)
#define NRF_DPPIC135_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC135_S_BASE)
#define NRF_TIMER134_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER134_NS_BASE)
#define NRF_TIMER134_S                    ((NRF_TIMER_Type*)                    NRF_TIMER134_S_BASE)
#define NRF_TIMER135_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER135_NS_BASE)
#define NRF_TIMER135_S                    ((NRF_TIMER_Type*)                    NRF_TIMER135_S_BASE)
#define NRF_PWM132_NS                     ((NRF_PWM_Type*)                      NRF_PWM132_NS_BASE)
#define NRF_PWM132_S                      ((NRF_PWM_Type*)                      NRF_PWM132_S_BASE)
#define NRF_SPIM134_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM134_NS_BASE)
#define NRF_SPIS134_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS134_NS_BASE)
#define NRF_TWIM134_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM134_NS_BASE)
#define NRF_TWIS134_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS134_NS_BASE)
#define NRF_UARTE134_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE134_NS_BASE)
#define NRF_SPIM134_S                     ((NRF_SPIM_Type*)                     NRF_SPIM134_S_BASE)
#define NRF_SPIS134_S                     ((NRF_SPIS_Type*)                     NRF_SPIS134_S_BASE)
#define NRF_TWIM134_S                     ((NRF_TWIM_Type*)                     NRF_TWIM134_S_BASE)
#define NRF_TWIS134_S                     ((NRF_TWIS_Type*)                     NRF_TWIS134_S_BASE)
#define NRF_UARTE134_S                    ((NRF_UARTE_Type*)                    NRF_UARTE134_S_BASE)
#define NRF_SPIM135_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM135_NS_BASE)
#define NRF_SPIS135_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS135_NS_BASE)
#define NRF_TWIM135_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM135_NS_BASE)
#define NRF_TWIS135_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS135_NS_BASE)
#define NRF_UARTE135_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE135_NS_BASE)
#define NRF_SPIM135_S                     ((NRF_SPIM_Type*)                     NRF_SPIM135_S_BASE)
#define NRF_SPIS135_S                     ((NRF_SPIS_Type*)                     NRF_SPIS135_S_BASE)
#define NRF_TWIM135_S                     ((NRF_TWIM_Type*)                     NRF_TWIM135_S_BASE)
#define NRF_TWIS135_S                     ((NRF_TWIS_Type*)                     NRF_TWIS135_S_BASE)
#define NRF_UARTE135_S                    ((NRF_UARTE_Type*)                    NRF_UARTE135_S_BASE)
#define NRF_PDM132_NS                     ((NRF_PDM_Type*)                      NRF_PDM132_NS_BASE)
#define NRF_PDM132_S                      ((NRF_PDM_Type*)                      NRF_PDM132_S_BASE)
#define NRF_DPPIC136_NS                   ((NRF_DPPIC_Type*)                    NRF_DPPIC136_NS_BASE)
#define NRF_DPPIC136_S                    ((NRF_DPPIC_Type*)                    NRF_DPPIC136_S_BASE)
#define NRF_TIMER136_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER136_NS_BASE)
#define NRF_TIMER136_S                    ((NRF_TIMER_Type*)                    NRF_TIMER136_S_BASE)
#define NRF_TIMER137_NS                   ((NRF_TIMER_Type*)                    NRF_TIMER137_NS_BASE)
#define NRF_TIMER137_S                    ((NRF_TIMER_Type*)                    NRF_TIMER137_S_BASE)
#define NRF_PWM133_NS                     ((NRF_PWM_Type*)                      NRF_PWM133_NS_BASE)
#define NRF_PWM133_S                      ((NRF_PWM_Type*)                      NRF_PWM133_S_BASE)
#define NRF_SPIM136_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM136_NS_BASE)
#define NRF_SPIS136_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS136_NS_BASE)
#define NRF_TWIM136_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM136_NS_BASE)
#define NRF_TWIS136_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS136_NS_BASE)
#define NRF_UARTE136_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE136_NS_BASE)
#define NRF_SPIM136_S                     ((NRF_SPIM_Type*)                     NRF_SPIM136_S_BASE)
#define NRF_SPIS136_S                     ((NRF_SPIS_Type*)                     NRF_SPIS136_S_BASE)
#define NRF_TWIM136_S                     ((NRF_TWIM_Type*)                     NRF_TWIM136_S_BASE)
#define NRF_TWIS136_S                     ((NRF_TWIS_Type*)                     NRF_TWIS136_S_BASE)
#define NRF_UARTE136_S                    ((NRF_UARTE_Type*)                    NRF_UARTE136_S_BASE)
#define NRF_SPIM137_NS                    ((NRF_SPIM_Type*)                     NRF_SPIM137_NS_BASE)
#define NRF_SPIS137_NS                    ((NRF_SPIS_Type*)                     NRF_SPIS137_NS_BASE)
#define NRF_TWIM137_NS                    ((NRF_TWIM_Type*)                     NRF_TWIM137_NS_BASE)
#define NRF_TWIS137_NS                    ((NRF_TWIS_Type*)                     NRF_TWIS137_NS_BASE)
#define NRF_UARTE137_NS                   ((NRF_UARTE_Type*)                    NRF_UARTE137_NS_BASE)
#define NRF_SPIM137_S                     ((NRF_SPIM_Type*)                     NRF_SPIM137_S_BASE)
#define NRF_SPIS137_S                     ((NRF_SPIS_Type*)                     NRF_SPIS137_S_BASE)
#define NRF_TWIM137_S                     ((NRF_TWIM_Type*)                     NRF_TWIM137_S_BASE)
#define NRF_TWIS137_S                     ((NRF_TWIS_Type*)                     NRF_TWIS137_S_BASE)
#define NRF_UARTE137_S                    ((NRF_UARTE_Type*)                    NRF_UARTE137_S_BASE)
#define NRF_PDM133_NS                     ((NRF_PDM_Type*)                      NRF_PDM133_NS_BASE)
#define NRF_PDM133_S                      ((NRF_PDM_Type*)                      NRF_PDM133_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

