ankuns/nrfx/bsp/stable/mdk/nrf7140_global.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
  #define NRF_FICR                                NRF_FICR_NS
  #define NRF_USBHSCORE0                          NRF_USBHSCORE0_NS
  #define NRF_I3CCORE120                          NRF_I3CCORE120_NS
  #define NRF_I3CCORE121                          NRF_I3CCORE121_NS
  #define NRF_DMU120                              NRF_DMU120_NS
  #define NRF_MCAN120                             NRF_MCAN120_NS
  #define NRF_DMU121                              NRF_DMU121_NS
  #define NRF_MCAN121                             NRF_MCAN121_NS
  #define NRF_STMDATA                             NRF_STMDATA_NS
  #define NRF_TDDCONF                             NRF_TDDCONF_NS
  #define NRF_TSGEN                               NRF_TSGEN_NS
  #define NRF_STM                                 NRF_STM_NS
  #define NRF_TPIU                                NRF_TPIU_NS
  #define NRF_ETB                                 NRF_ETB_NS
  #define NRF_ETR                                 NRF_ETR_NS
  #define NRF_CTI210                              NRF_CTI210_NS
  #define NRF_CTI211                              NRF_CTI211_NS
  #define NRF_ATBREPLICATOR210                    NRF_ATBREPLICATOR210_NS
  #define NRF_ATBREPLICATOR211                    NRF_ATBREPLICATOR211_NS
  #define NRF_ATBREPLICATOR212                    NRF_ATBREPLICATOR212_NS
  #define NRF_ATBREPLICATOR213                    NRF_ATBREPLICATOR213_NS
  #define NRF_ATBFUNNEL210                        NRF_ATBFUNNEL210_NS
  #define NRF_ATBFUNNEL211                        NRF_ATBFUNNEL211_NS
  #define NRF_ATBFUNNEL212                        NRF_ATBFUNNEL212_NS
  #define NRF_ATBFUNNEL213                        NRF_ATBFUNNEL213_NS
  #define NRF_GFXPLL                              NRF_GFXPLL_NS
  #define NRF_GFXPLLPM                            NRF_GFXPLLPM_NS
  #define NRF_PCGCSBUS                            NRF_PCGCSBUS_NS
  #define NRF_HSFLL300                            NRF_HSFLL300_NS
  #define NRF_LRCCONF300                          NRF_LRCCONF300_NS
  #define NRF_PCGCM300                            NRF_PCGCM300_NS
  #define NRF_MEMCONF310                          NRF_MEMCONF310_NS
  #define NRF_VREGGFX                             NRF_VREGGFX_NS
  #define NRF_LRCCONF310                          NRF_LRCCONF310_NS
  #define NRF_PCGCM310                            NRF_PCGCM310_NS
  #define NRF_GPIOTE130                           NRF_GPIOTE130_NS
  #define NRF_GRTC                                NRF_GRTC_NS
  #define NRF_GSI                                 NRF_GSI_NS
  #define NRF_DISPC                               NRF_DISPC_NS
  #define NRF_GPU                                 NRF_GPU_NS
  #define NRF_TBM                                 NRF_TBM_NS
  #define NRF_USBHS                               NRF_USBHS_NS
  #define NRF_MRAMC110                            NRF_MRAMC110_NS
  #define NRF_MRAMC111                            NRF_MRAMC111_NS
  #define NRF_EXMIF                               NRF_EXMIF_NS
  #define NRF_CANPLL                              NRF_CANPLL_NS
  #define NRF_VPR120                              NRF_VPR120_NS
  #define NRF_SDCARD                              NRF_SDCARD_NS
  #define NRF_LRCCONF_SDCARD                      NRF_LRCCONF_SDCARD_NS
  #define NRF_HSFLL122                            NRF_HSFLL122_NS
  #define NRF_HSFLL121                            NRF_HSFLL121_NS
  #define NRF_IPCT120                             NRF_IPCT120_NS
  #define NRF_MUTEX120                            NRF_MUTEX120_NS
  #define NRF_PROTOTYPE                           NRF_PROTOTYPE_NS
  #define NRF_I3C120                              NRF_I3C120_NS
  #define NRF_VPR121                              NRF_VPR121_NS
  #define NRF_QSPI120                             NRF_QSPI120_NS
  #define NRF_CAN120                              NRF_CAN120_NS
  #define NRF_MVDMA120                            NRF_MVDMA120_NS
  #define NRF_RAMC122                             NRF_RAMC122_NS
  #define NRF_CAN121                              NRF_CAN121_NS
  #define NRF_MVDMA121                            NRF_MVDMA121_NS
  #define NRF_RAMC123                             NRF_RAMC123_NS
  #define NRF_I3C121                              NRF_I3C121_NS
  #define NRF_QSPI121                             NRF_QSPI121_NS
  #define NRF_DPPIC120                            NRF_DPPIC120_NS
  #define NRF_TIMER120                            NRF_TIMER120_NS
  #define NRF_TIMER121                            NRF_TIMER121_NS
  #define NRF_PWM120                              NRF_PWM120_NS
  #define NRF_SPIS120                             NRF_SPIS120_NS
  #define NRF_SPIM120                             NRF_SPIM120_NS
  #define NRF_UARTE120                            NRF_UARTE120_NS
  #define NRF_SPIM121                             NRF_SPIM121_NS
  #define NRF_SPIM122                             NRF_SPIM122_NS
  #define NRF_SPIM123                             NRF_SPIM123_NS
  #define NRF_VPR130                              NRF_VPR130_NS
  #define NRF_IPCT130                             NRF_IPCT130_NS
  #define NRF_DPPIC130                            NRF_DPPIC130_NS
  #define NRF_MUTEX130                            NRF_MUTEX130_NS
  #define NRF_RTC130                              NRF_RTC130_NS
  #define NRF_RTC131                              NRF_RTC131_NS
  #define NRF_WDT131                              NRF_WDT131_NS
  #define NRF_WDT132                              NRF_WDT132_NS
  #define NRF_EGU130                              NRF_EGU130_NS
  #define NRF_COEXC                               NRF_COEXC_NS
  #define NRF_P0                                  NRF_P0_NS
  #define NRF_P1                                  NRF_P1_NS
  #define NRF_P2                                  NRF_P2_NS
  #define NRF_P3                                  NRF_P3_NS
  #define NRF_P5                                  NRF_P5_NS
  #define NRF_P6                                  NRF_P6_NS
  #define NRF_P8                                  NRF_P8_NS
  #define NRF_P9                                  NRF_P9_NS
  #define NRF_GPIOINTERNAL                        NRF_GPIOINTERNAL_NS
  #define NRF_AUDIOPLL                            NRF_AUDIOPLL_NS
  #define NRF_USBHSPLL                            NRF_USBHSPLL_NS
  #define NRF_VREGUSB                             NRF_VREGUSB_NS
  #define NRF_AUDIOPLLPM                          NRF_AUDIOPLLPM_NS
  #define NRF_DPPIC131                            NRF_DPPIC131_NS
  #define NRF_SAADC                               NRF_SAADC_NS
  #define NRF_COMP                                NRF_COMP_NS
  #define NRF_LPCOMP                              NRF_LPCOMP_NS
  #define NRF_TEMP                                NRF_TEMP_NS
  #define NRF_NFCT                                NRF_NFCT_NS
  #define NRF_DPPIC132                            NRF_DPPIC132_NS
  #define NRF_TDM130                              NRF_TDM130_NS
  #define NRF_QDEC130                             NRF_QDEC130_NS
  #define NRF_QDEC131                             NRF_QDEC131_NS
  #define NRF_SIMIF130                            NRF_SIMIF130_NS
  #define NRF_TDM131                              NRF_TDM131_NS
  #define NRF_TDM132                              NRF_TDM132_NS
  #define NRF_DPPIC133                            NRF_DPPIC133_NS
  #define NRF_TIMER130                            NRF_TIMER130_NS
  #define NRF_TIMER131                            NRF_TIMER131_NS
  #define NRF_PWM130                              NRF_PWM130_NS
  #define NRF_SPIM130                             NRF_SPIM130_NS
  #define NRF_SPIS130                             NRF_SPIS130_NS
  #define NRF_TWIM130                             NRF_TWIM130_NS
  #define NRF_TWIS130                             NRF_TWIS130_NS
  #define NRF_UARTE130                            NRF_UARTE130_NS
  #define NRF_SPIM131                             NRF_SPIM131_NS
  #define NRF_SPIS131                             NRF_SPIS131_NS
  #define NRF_TWIM131                             NRF_TWIM131_NS
  #define NRF_TWIS131                             NRF_TWIS131_NS
  #define NRF_UARTE131                            NRF_UARTE131_NS
  #define NRF_PDM130                              NRF_PDM130_NS
  #define NRF_DPPIC134                            NRF_DPPIC134_NS
  #define NRF_TIMER132                            NRF_TIMER132_NS
  #define NRF_TIMER133                            NRF_TIMER133_NS
  #define NRF_PWM131                              NRF_PWM131_NS
  #define NRF_SPIM132                             NRF_SPIM132_NS
  #define NRF_SPIS132                             NRF_SPIS132_NS
  #define NRF_TWIM132                             NRF_TWIM132_NS
  #define NRF_TWIS132                             NRF_TWIS132_NS
  #define NRF_UARTE132                            NRF_UARTE132_NS
  #define NRF_SPIM133                             NRF_SPIM133_NS
  #define NRF_SPIS133                             NRF_SPIS133_NS
  #define NRF_TWIM133                             NRF_TWIM133_NS
  #define NRF_TWIS133                             NRF_TWIS133_NS
  #define NRF_UARTE133                            NRF_UARTE133_NS
  #define NRF_PDM131                              NRF_PDM131_NS
  #define NRF_DPPIC135                            NRF_DPPIC135_NS
  #define NRF_TIMER134                            NRF_TIMER134_NS
  #define NRF_TIMER135                            NRF_TIMER135_NS
  #define NRF_PWM132                              NRF_PWM132_NS
  #define NRF_SPIM134                             NRF_SPIM134_NS
  #define NRF_SPIS134                             NRF_SPIS134_NS
  #define NRF_TWIM134                             NRF_TWIM134_NS
  #define NRF_TWIS134                             NRF_TWIS134_NS
  #define NRF_UARTE134                            NRF_UARTE134_NS
  #define NRF_SPIM135                             NRF_SPIM135_NS
  #define NRF_SPIS135                             NRF_SPIS135_NS
  #define NRF_TWIM135                             NRF_TWIM135_NS
  #define NRF_TWIS135                             NRF_TWIS135_NS
  #define NRF_UARTE135                            NRF_UARTE135_NS
  #define NRF_PDM132                              NRF_PDM132_NS
  #define NRF_DPPIC136                            NRF_DPPIC136_NS
  #define NRF_TIMER136                            NRF_TIMER136_NS
  #define NRF_TIMER137                            NRF_TIMER137_NS
  #define NRF_PWM133                              NRF_PWM133_NS
  #define NRF_SPIM136                             NRF_SPIM136_NS
  #define NRF_SPIS136                             NRF_SPIS136_NS
  #define NRF_TWIM136                             NRF_TWIM136_NS
  #define NRF_TWIS136                             NRF_TWIS136_NS
  #define NRF_UARTE136                            NRF_UARTE136_NS
  #define NRF_SPIM137                             NRF_SPIM137_NS
  #define NRF_SPIS137                             NRF_SPIS137_NS
  #define NRF_TWIM137                             NRF_TWIM137_NS
  #define NRF_TWIS137                             NRF_TWIS137_NS
  #define NRF_UARTE137                            NRF_UARTE137_NS
  #define NRF_PDM133                              NRF_PDM133_NS
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_FICR                                NRF_FICR_NS
  #define NRF_USBHSCORE0                          NRF_USBHSCORE0_S
  #define NRF_I3CCORE120                          NRF_I3CCORE120_NS
  #define NRF_I3CCORE121                          NRF_I3CCORE121_NS
  #define NRF_DMU120                              NRF_DMU120_NS
  #define NRF_MCAN120                             NRF_MCAN120_NS
  #define NRF_DMU121                              NRF_DMU121_NS
  #define NRF_MCAN121                             NRF_MCAN121_NS
  #define NRF_STMDATA                             NRF_STMDATA_S
  #define NRF_TDDCONF                             NRF_TDDCONF_S
  #define NRF_TSGEN                               NRF_TSGEN_NS
  #define NRF_STM                                 NRF_STM_NS
  #define NRF_TPIU                                NRF_TPIU_NS
  #define NRF_ETB                                 NRF_ETB_NS
  #define NRF_ETR                                 NRF_ETR_NS
  #define NRF_CTI210                              NRF_CTI210_NS
  #define NRF_CTI211                              NRF_CTI211_NS
  #define NRF_ATBREPLICATOR210                    NRF_ATBREPLICATOR210_NS
  #define NRF_ATBREPLICATOR211                    NRF_ATBREPLICATOR211_NS
  #define NRF_ATBREPLICATOR212                    NRF_ATBREPLICATOR212_NS
  #define NRF_ATBREPLICATOR213                    NRF_ATBREPLICATOR213_NS
  #define NRF_ATBFUNNEL210                        NRF_ATBFUNNEL210_NS
  #define NRF_ATBFUNNEL211                        NRF_ATBFUNNEL211_NS
  #define NRF_ATBFUNNEL212                        NRF_ATBFUNNEL212_NS
  #define NRF_ATBFUNNEL213                        NRF_ATBFUNNEL213_NS
  #define NRF_GFXPLL                              NRF_GFXPLL_NS
  #define NRF_GFXPLLPM                            NRF_GFXPLLPM_NS
  #define NRF_PCGCSBUS                            NRF_PCGCSBUS_NS
  #define NRF_HSFLL300                            NRF_HSFLL300_NS
  #define NRF_LRCCONF300                          NRF_LRCCONF300_NS
  #define NRF_PCGCM300                            NRF_PCGCM300_NS
  #define NRF_MEMCONF310                          NRF_MEMCONF310_NS
  #define NRF_VREGGFX                             NRF_VREGGFX_NS
  #define NRF_LRCCONF310                          NRF_LRCCONF310_NS
  #define NRF_PCGCM310                            NRF_PCGCM310_NS
  #define NRF_GPIOTE130                           NRF_GPIOTE130_S
  #define NRF_GRTC                                NRF_GRTC_S
  #define NRF_GSI                                 NRF_GSI_NS
  #define NRF_DISPC                               NRF_DISPC_NS
  #define NRF_GPU                                 NRF_GPU_NS
  #define NRF_TBM                                 NRF_TBM_S
  #define NRF_USBHS                               NRF_USBHS_S
  #define NRF_MRAMC110                            NRF_MRAMC110_S
  #define NRF_MRAMC111                            NRF_MRAMC111_S
  #define NRF_EXMIF                               NRF_EXMIF_S
  #define NRF_CANPLL                              NRF_CANPLL_S
  #define NRF_CANPLLPM                            NRF_CANPLLPM_S
  #define NRF_OTPC                                NRF_OTPC_S
  #define NRF_VPR120                              NRF_VPR120_S
  #define NRF_SDCARD                              NRF_SDCARD_S
  #define NRF_LRCCONF_SDCARD                      NRF_LRCCONF_SDCARD_NS
  #define NRF_HSFLL122                            NRF_HSFLL122_S
  #define NRF_HSFLL121                            NRF_HSFLL121_S
  #define NRF_IPCT120                             NRF_IPCT120_S
  #define NRF_MUTEX120                            NRF_MUTEX120_NS
  #define NRF_PROTOTYPE                           NRF_PROTOTYPE_NS
  #define NRF_I3C120                              NRF_I3C120_S
  #define NRF_VPR121                              NRF_VPR121_S
  #define NRF_QSPI120                             NRF_QSPI120_S
  #define NRF_CAN120                              NRF_CAN120_S
  #define NRF_MVDMA120                            NRF_MVDMA120_S
  #define NRF_RAMC122                             NRF_RAMC122_S
  #define NRF_CAN121                              NRF_CAN121_S
  #define NRF_MVDMA121                            NRF_MVDMA121_S
  #define NRF_RAMC123                             NRF_RAMC123_S
  #define NRF_I3C121                              NRF_I3C121_S
  #define NRF_QSPI121                             NRF_QSPI121_S
  #define NRF_DPPIC120                            NRF_DPPIC120_S
  #define NRF_TIMER120                            NRF_TIMER120_S
  #define NRF_TIMER121                            NRF_TIMER121_S
  #define NRF_PWM120                              NRF_PWM120_S
  #define NRF_SPIS120                             NRF_SPIS120_S
  #define NRF_SPIM120                             NRF_SPIM120_S
  #define NRF_UARTE120                            NRF_UARTE120_S
  #define NRF_SPIM121                             NRF_SPIM121_S
  #define NRF_SPIM122                             NRF_SPIM122_S
  #define NRF_SPIM123                             NRF_SPIM123_S
  #define NRF_VPR130                              NRF_VPR130_S
  #define NRF_IPCT130                             NRF_IPCT130_S
  #define NRF_DPPIC130                            NRF_DPPIC130_S
  #define NRF_MUTEX130                            NRF_MUTEX130_NS
  #define NRF_RTC130                              NRF_RTC130_S
  #define NRF_RTC131                              NRF_RTC131_S
  #define NRF_WDT131                              NRF_WDT131_S
  #define NRF_WDT132                              NRF_WDT132_S
  #define NRF_EGU130                              NRF_EGU130_S
  #define NRF_COEXC                               NRF_COEXC_S
  #define NRF_P0                                  NRF_P0_S
  #define NRF_P1                                  NRF_P1_S
  #define NRF_P2                                  NRF_P2_S
  #define NRF_P3                                  NRF_P3_S
  #define NRF_P5                                  NRF_P5_S
  #define NRF_P6                                  NRF_P6_S
  #define NRF_P8                                  NRF_P8_S
  #define NRF_P9                                  NRF_P9_S
  #define NRF_GPIOINTERNAL                        NRF_GPIOINTERNAL_S
  #define NRF_RESETHUB                            NRF_RESETHUB_S
  #define NRF_AUDIOPLL                            NRF_AUDIOPLL_S
  #define NRF_USBHSPLL                            NRF_USBHSPLL_S
  #define NRF_VREGUSB                             NRF_VREGUSB_S
  #define NRF_AUDIOPLLPM                          NRF_AUDIOPLLPM_S
  #define NRF_DPPIC131                            NRF_DPPIC131_S
  #define NRF_SAADC                               NRF_SAADC_S
  #define NRF_COMP                                NRF_COMP_S
  #define NRF_LPCOMP                              NRF_LPCOMP_S
  #define NRF_TEMP                                NRF_TEMP_S
  #define NRF_NFCT                                NRF_NFCT_S
  #define NRF_DPPIC132                            NRF_DPPIC132_S
  #define NRF_TDM130                              NRF_TDM130_S
  #define NRF_QDEC130                             NRF_QDEC130_S
  #define NRF_QDEC131                             NRF_QDEC131_S
  #define NRF_SIMIF130                            NRF_SIMIF130_S
  #define NRF_TDM131                              NRF_TDM131_S
  #define NRF_TDM132                              NRF_TDM132_S
  #define NRF_DPPIC133                            NRF_DPPIC133_S
  #define NRF_TIMER130                            NRF_TIMER130_S
  #define NRF_TIMER131                            NRF_TIMER131_S
  #define NRF_PWM130                              NRF_PWM130_S
  #define NRF_SPIM130                             NRF_SPIM130_S
  #define NRF_SPIS130                             NRF_SPIS130_S
  #define NRF_TWIM130                             NRF_TWIM130_S
  #define NRF_TWIS130                             NRF_TWIS130_S
  #define NRF_UARTE130                            NRF_UARTE130_S
  #define NRF_SPIM131                             NRF_SPIM131_S
  #define NRF_SPIS131                             NRF_SPIS131_S
  #define NRF_TWIM131                             NRF_TWIM131_S
  #define NRF_TWIS131                             NRF_TWIS131_S
  #define NRF_UARTE131                            NRF_UARTE131_S
  #define NRF_PDM130                              NRF_PDM130_S
  #define NRF_DPPIC134                            NRF_DPPIC134_S
  #define NRF_TIMER132                            NRF_TIMER132_S
  #define NRF_TIMER133                            NRF_TIMER133_S
  #define NRF_PWM131                              NRF_PWM131_S
  #define NRF_SPIM132                             NRF_SPIM132_S
  #define NRF_SPIS132                             NRF_SPIS132_S
  #define NRF_TWIM132                             NRF_TWIM132_S
  #define NRF_TWIS132                             NRF_TWIS132_S
  #define NRF_UARTE132                            NRF_UARTE132_S
  #define NRF_SPIM133                             NRF_SPIM133_S
  #define NRF_SPIS133                             NRF_SPIS133_S
  #define NRF_TWIM133                             NRF_TWIM133_S
  #define NRF_TWIS133                             NRF_TWIS133_S
  #define NRF_UARTE133                            NRF_UARTE133_S
  #define NRF_PDM131                              NRF_PDM131_S
  #define NRF_DPPIC135                            NRF_DPPIC135_S
  #define NRF_TIMER134                            NRF_TIMER134_S
  #define NRF_TIMER135                            NRF_TIMER135_S
  #define NRF_PWM132                              NRF_PWM132_S
  #define NRF_SPIM134                             NRF_SPIM134_S
  #define NRF_SPIS134                             NRF_SPIS134_S
  #define NRF_TWIM134                             NRF_TWIM134_S
  #define NRF_TWIS134                             NRF_TWIS134_S
  #define NRF_UARTE134                            NRF_UARTE134_S
  #define NRF_SPIM135                             NRF_SPIM135_S
  #define NRF_SPIS135                             NRF_SPIS135_S
  #define NRF_TWIM135                             NRF_TWIM135_S
  #define NRF_TWIS135                             NRF_TWIS135_S
  #define NRF_UARTE135                            NRF_UARTE135_S
  #define NRF_PDM132                              NRF_PDM132_S
  #define NRF_DPPIC136                            NRF_DPPIC136_S
  #define NRF_TIMER136                            NRF_TIMER136_S
  #define NRF_TIMER137                            NRF_TIMER137_S
  #define NRF_PWM133                              NRF_PWM133_S
  #define NRF_SPIM136                             NRF_SPIM136_S
  #define NRF_SPIS136                             NRF_SPIS136_S
  #define NRF_TWIM136                             NRF_TWIM136_S
  #define NRF_TWIS136                             NRF_TWIS136_S
  #define NRF_UARTE136                            NRF_UARTE136_S
  #define NRF_SPIM137                             NRF_SPIM137_S
  #define NRF_SPIS137                             NRF_SPIS137_S
  #define NRF_TWIM137                             NRF_TWIM137_S
  #define NRF_TWIS137                             NRF_TWIS137_S
  #define NRF_UARTE137                            NRF_UARTE137_S
  #define NRF_PDM133                              NRF_PDM133_S
#endif                                               /*!< NRF_TRUSTZONE_NONSECURE                                              */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_GLOBAL_H */

